from .. import Provider as CompanyProvider


class Provider(CompanyProvider):
    formats = (
        "{{company_suffix}} {{company_name}} {{company_suffix}}",
        "{{company_suffix}} {{last_name}} {{company_suffix}}",
    )

    company_prefix = (
        "أكاديمية",
        "شركة",
        "عيادات",
        "مؤسسة",
        "متجر",
        "مجموعة",
        "مخابز",
        "مدارس",
        "مركز",
        "مستشفى",
        "مصنع",
        "مقاهي",
        "مكتب",
        "منصة",
    )

    company_domain = (
    "الأغذية",
    "الاتصالات",
    "الاستثمار",
    "الاستشارات",
    "البتروكيماويات",
    "التجارة الإلكترونية",
    "التسويق",
    "التطوير العقاري",
    "التعليم",
    "التقنية",
    "التمويل",
    "الحلول الرقمية",
    "الخدمات اللوجستية",
    "الرعاية الصحية",
    "السياحة",
    "النقل",
    "الأمن السيبراني",
    "التجزئة",
    "الطاقة",
  )
    company_suffixes = (
        "السعودية",
        "القابضة",
        "العالمية",
        "الحديثة",
        "المتكاملة",
        "العربية",
        "المتميزة",
        "الذكية",
        "المتقدمة",
        "الخليجية",
    )
